improved the readme file
